# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
# import libraries here
import numpy as np
import pandas as pd

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
# your code here
temp=pd.read_csv(r'C:\Users\iauzm\OneDrive\Escritorio\DATA\week4\subsetting-and-descriptive-stats\your-code\Temp_States.csv')
temp.head()

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444

#### Print `temp`.

In [5]:
# your code here
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [8]:
# your code here
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [9]:
temp.nunique()

City           7
State          3
Temperature    7
dtype: int64

In [ ]:
"""
your comments here
there 2 columns with string values and the tmep columns as float.
the only column with repeated values is state

"""

#### Select the rows where state is New York.

In [15]:
# your code here
new_york_rows = temp[temp['State'] == 'New York']
print(new_york_rows)

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [19]:
# your code here
new_york_avg_temp=new_york_rows['Temperature'].mean()
new_york_avg_temp=round(new_york_avg_temp,2)
print('The average temperature of cities in New York is :',new_york_avg_temp)

The average temperature of cities in New York is : 10.74

#### Which states and cities have a temperature above 15 degrees Celsius?

In [25]:
# your code here
hot_rows = temp[temp['Temperature'] > 15]
print(hot_rows)

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [24]:
# your code here
hot_cities = hot_rows['City'].unique()
print("Cities with temperature above 15 degrees :", hot_cities)

Cities with temperature above 15 degrees : ['NYC' 'Hartford' 'Treton' 'Newark']

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [30]:
# your code here
not_so_hot_rows = temp[(temp['Temperature'] > 15) & (temp['Temperature'] < 20)]
not_so_hot_cities = not_so_hot_rows['City'].unique()
print("Cities with temperature above 15 and below 20 degrees Celsius:")
for city in not_so_hot_cities:
    print(city)

Cities with temperature above 15 and below 20 degrees Celsius:
NYC
Hartford

#### Find the mean and standard deviation of the temperature of each state.

In [34]:
# your code here
mean_temperature = temp.groupby('State')['Temperature'].mean()
mean_temperature=round(mean_temperature,2)
std_temperature = temp.groupby('State')['Temperature'].std()
std_temperature=round(std_temperature,2)
for state in mean_temperature.index:
    mean = mean_temperature[state]
    std = std_temperature[state]
    print("State:", state,":")
    print("Mean Temperature:", mean,"ºC")
    print("Standard Deviation:", std,"ºC")

State: Connecticut :
Mean Temperature: 15.83 ºC
Standard Deviation: 1.96 ºC
State: New Jersey :
Mean Temperature: 21.11 ºC
Standard Deviation: 1.57 ºC
State: New York :
Mean Temperature: 10.74 ºC
Standard Deviation: 8.13 ºC

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [ ]:
# your code here

#### Explore the data types of the `employees` dataframe. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

#### What's the average salary in this company?

In [ ]:
# your code here

#### What's the highest salary?

In [ ]:
# your code here

#### What's the lowest salary?

In [ ]:
# your code here

#### Who are the employees with the lowest salary?

In [ ]:
# your code here

#### Find all the information about an employee called David.

In [ ]:
# your code here

#### Could you return only David's salary?

In [ ]:
# your code here

#### Print all the rows where job title is associate.

In [ ]:
# your code here

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [ ]:
# Method 1
# your code here

In [ ]:
# Method 2
# your code here

#### Find the employees whose title is associate and whose salary is above 55.

In [ ]:
# your code here

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [ ]:
# your code here

####  What is the average salary per title?

In [ ]:
# your code here

####  Find the salary quartiles.

In [ ]:
# your code here

#### Is the mean salary different per gender?

In [ ]:
# your code here

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [ ]:
# your code here

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [ ]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [ ]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [ ]:
# your code here

In [ ]:
"""
your comments here
"""

####  What is the average purchase price?

In [ ]:
# your code here

#### What are the highest and lowest purchase prices?

In [ ]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [ ]:
# your code here

#### How many customers do we have in Spain?

In [ ]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [ ]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [ ]:
# your code here

#### Select all free orders.

In [ ]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [ ]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [ ]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [ ]:
# your code here

#### Select all orders made in the month of August.

In [ ]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [ ]:
# your code here

#### What's the  average amount of money spent by country?

In [ ]:
# your code here

#### What's the most expensive item?

In [ ]:
# your code here

#### What is the average amount spent per year?

In [ ]:
# your code here